# Process Assignment 1: Data Cleaning & Pre-processing
Welcome to the first process assessment. This is divided in two equally weighed parts, one theory-based quiz and one code-based.
- Quiz: 50% of the total
- Coding: 50% of the total


# Part 1: Quiz
The first part is a 5-question quiz on data cleaning and preprocessing using Python. Answer the following 5 multiple-choice questions. Double click on this cell to type your answers below.

### Question 1:
**What is the first step in the data science lifecycle?**
*(Select 1)*
- a) Data Collection  
- b) Problem Definition  
- c) Model Building  
- d) Data Cleaning  

Type your answer here: b

### Question 2:
**Which scale allows additivity and multiplicative interpretations, such as saying 80 miles is "twice as far" as 40 miles?**
*(Select 1)*
- a) nominal	
- b) ordinal
- c) interval
- d) ratio

Type your answer here: d

### Question 3:
**Which of the following is an example of an ordinal scale?**  
- a) biological sex
- b) class rank
- c) temperature
- d) distance

Type your answer here: b

### Question 4:
**What is the primary difference between .loc and .iloc when selecting data in a pandas DataFrame?** (Select 1)
- a) `.loc` selects data based on index labels, while `.iloc` selects data based on integer-based positions.
- b) `.loc` can only be used for selecting rows, whereas `.iloc` can be used for selecting both rows and columns.  
- c) `.iloc` is faster than `.loc` because it can handle missing data, while `.loc` cannot.  
- d) `.iloc` selects data based on index labels, while `.loc` selects data based on integer-based positions.  

Type your answer here: a

### Question 5:
**Read the Pandas documentation of the method [`.fillna`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html). What is the correct way to apply this method if you wanted to fill `NaN` values in a specific column called "Score" with the mean value of that column?**
- a) `df.fillna(method="bfill", inplace=True)`
- b) `df.fillna(axis="Score", value="mean", inplace=True)`
- c) `df["Score"].fillna(value=df["Score"].mean(), inplace=True)`
- d) `df["Score"].fillna("mean", inplace=True)` 

Type your answer here: c

# Part 2: Coding
In the next section, you will perform some basic data manipulation exercises, often used in data cleaning and preprocessing.

This part is divided in 5 tasks, each worth 0.5 point. Each exercise build on the previous one.

## Task 1
Import the following libraries:
- numpy
- pandas
- matplotlib.pyplot
- seaborn

using the associated aliases:
- np
- pd
- plt
- sns

In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

In [2]:
# you can run this cell to test your solution
assert pd
assert np
assert plt
assert sns

## Task 2
Let's load some data!
Please load the data file `data.csv` that accompanies this notebook in a pandas dataframe called `df`.

In [4]:
df = pd.read_csv('/Users/olisa/Lis/data_sci/week2/process assessment 1/data/data.csv')

In [5]:
# test your solution by running this cell
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## Task 3

Print the number of missing values in each column of the DataFrame `df`.

In [6]:
print(df.isnull().sum())

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

## Task 4

Create a new dataframe `df_num` that contains only the numerical columns of `df`.

In [7]:
# your code here
df_num = df.drop(columns=["Country", "Purchased"])

In [8]:
# You can test your solution by running this cell. Does df_num contain what you expected?
df_num

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

## Task 5
Create a new DataFrame named `df0` by filling the missing values in `df_num` with zeros, while keeping the original `df_num` unchanged. (0.25 points)

In [9]:
# your code here
df0 = df_num.fillna(0)

In [12]:
# Test your solution by running this cell. It will output the current df.
# Did your code in the previous cell fill the null values with a zero?
print('Original dataframe:')
print(df_num.head())
print('Filled dataframe:')
print(df0.head())

Original dataframe:
    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
Filled dataframe:
    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      0.0

Can you see any issues in assigning zero to a null value in the column Salary? If so, what alternative approaches would you follow? (0.25 points)

As there is too little a number of data points to just take out that row (e.g it would significantly effect the final result, in addition a salary is expected to be much higher than zero)) I would calculate the mean salary with the data i have got then use that mean value inplace of the zero